/**
 * Created by liuwenju on 2016/6/3.
 */

var book1 = new Book("教育方法学"," 作者佐藤学，翻译于莉莉 ",300,"教育科学出版社出版","每一秒的爱意都不能被浪费，电影里的意犹未尽全在书里。广受好评的国产爱情片《北京遇上西雅图之不二情书》1012-油翁班主任工作招招鲜原著小说，同步上市！","2016年3月第一版，2016年3月第1次印刷","");
var code_name1 = "2016-福建小尘";
var nick_name1 = "小尘";
var wittness_declaration1 = '坚持读，坚持记，成就更好的自己。';
var wittness_content1 = '本书是国际著名课程专家佐藤学教授的代表作，在日本印刷25次。本书聚焦教学、学习、课堂、课程、教师、教师教育、教育信息化等方面，整理分析了最新的教育学知识与问题，揭示了新的教育实践的方向。本书既是综合概括了近三十年来教育学研究范式转变的航海图，又是提出新的研究方向的罗盘针。本书既是教育学的教科书，也是汇集了作者对书中所网罗知识的独特的个人新见解的心血结晶。书中深入浅出的教学观、课程观、教师观、师生互动观等，带给教师诸多有益启发，读者据此可以建构各自的教育学观、展开独自的教育学设计。本书适合于中小学幼儿教师、校长、教育管理者、教育研究者，以及所有关心中国教育改革的人士阅读。也特别适合中小学幼儿教师和校长培训。@@@不喜欢读书但想读书的朋友，想读书但坚持不了的朋友，想让阅读更享受的朋友可以加入公益坚持读群:16805139，坚持读微信订阅号:jianchidu。加入微群,有红包获得，每月的坚持读阅享见证日都会发坚持读祝福红包….如何加入详见QQ群和订阅号。@@@读者坚持读的老人了，阅享见证非常认真，而且时而会出原创文章，值得大家学习，同时奖励<strong style="color: red;"> 10 </strong>枚阅享坚果，今天正好是父亲节，祝天下的父亲们节日快乐。@@@尘游书海2016165：让自己专业起来@@@2016年6月17日，开始悦享《教育方法学》作者佐藤学，翻译于莉莉,教育科学出版社出版,2016年3月第一版，2016年3月第1次印刷，全书回顾2。特此见证，感谢坚持读。@@@让自己专业起来@@@——读《教育方法学》@@@福建陈秀玉@@@什么是课程？简单地说就是“学习经验的总和”。在读《静悄悄的革命》时也谈到了这个问题。读《教育方法学》时更为系统地学习。知道了课程的来源。那个原意为跑道的词源，有点意思。对于今天来说，“基于课题组织”的课程，因它可以“设定各种各样的主题与问题并加以组织”，所以更利于我们教师自己来设计。这些课程也更值得我们重视。因为“以这些课题为中心组织编制的课程可以发挥出整合多种学科文化领域、组织以现实问题为对象的批判性思维与问题解决性思维，赋予儿童学习现实意义使学校教育与社会相结合的功能。”@@@看到“隐性课程”，想到教学中的明线与暗线，暗线虽然看不到，却有着深刻的影响。尽自己所能避免“隐性课程”的负面影响吧。“教室，是一个学习适应权利及应对方法的场所。”读到这边，心里不怎么舒服。但仔细一想，确实这样。尽自己所能，让教室中的“群集”、“赞赏”、“权力”尽量发挥其好的作用吧。只是感觉，教师的作用毕竟有限。今天有网友问:“怎么看‘没有教不好的学生，只有不会教的老师’这句话。”我回:“有人顺着说:没有治不好的病，只有不会治的医生。我想到了小时候听到的故事，种子被煮熟要让它发芽。可能吗？就是残缺或坏掉的种子也难以发芽或难长好。所以不管砖家怎么绕，都是耍流氓。”蔡老师跟:“小尘（我网名）的联想让我想到刘良华老师说过，13岁以后的孩子，需要的不是教育，而是治疗。既然不是什么肉体上的病都能治，那教育的病也可以类推。陈鹤琴先生说这句话可能是对幼童而言吧，还可以教育的。”我感叹:“教师别看不起自己，也别太把自己当回事，尽力干好良心活，孩子成长看造化。王子和公主从此过上幸福生活，这样的童话听听即可，别太较真。”@@@有时觉得，我们的力量的确很小。特别是在教育现场，确实有一些无力感。尽管这样，仍然尽力做好，寻求一厘米之变。假如我们的努力，能擦亮一颗星星，或拯救一只知更鸟，足矣！是的，积蓄力量，不是为了翻天覆地，拯救全人类。只是为了，改善能够改善的，尽自己的一份微薄之力，让教育环境，让社会环境，有变好的可能。@@@教师应该是一个专业性职业，可事实并非如此。文中举了专业性职业的六个特点，并逐一对照分析。结论是教师还达不到这种专业程度。因为六条中指符合第一条“具有高度公共性的职业”，从第二到第六条，教师这一职业实际上并没有完全达到标准。由此导致，教师实际上并不是“专家”，而是“公仆”。@@@文中说“‘作为公仆的教师’不仅仅是在日本，而且是世界各国近代学校教育制度下教师的共性。而花费了近一个世纪的时间，力求摆脱‘作为公仆的教师’的制度框架的诉求，推动了教师职业的专业化进程。”@@@应该说教师是专业性的职业，我们如何让它真正的专业起来呢？这个问题值得思考。@@@教师文化是指教师在职业共同体中所形成的一种模式的文化。包括以下几种类型:“作为公仆的教师”、“作为劳动者的教师”、“作为技术熟练者的教师”、“作为反思性实践家的教师”。佐藤学说：“现今的教师文化，是以‘作为公仆的教师’的规范与意识作为官僚性行政制度文化的基底，同时在教师专业化方面又以“作为技术熟练者的教师”的规范作为另一种支配性文化而在教育一线不断渗透。”也因此“作为反思性实践家的教师”得以形成并传承。@@@在读《教育的细节》时，特别关注了朱永通谈到的一个事例:因两位舞蹈老师不同的处事风格，让女儿对舞蹈有不同的态度。本应是专业的C教师更有魅力，更让女儿喜欢，结果却是不很专业的W老师更得孩子们的心，而且孩子们学得更好。@@@是什么原因造成这样的不对等呢？朱永通给出了他的思考：“同一件事，不同观念形塑下的不同处理方式，所激发的情感回应截然相反，可见，情感是教育中不容小觑的人性成分。”@@@写读书笔记时，我也记下了我的思考：“我认同他的观点，又不完全赞同。情感在这里的作用确实不小，但似乎还有一种因素在影响着。我觉得与这位老师的学习习惯也有关。一般专业的老师本身有一些天赋，且较喜欢，所以学本专业的东西就较快，他们会根据自己的学习经验进行传授，步伐也会偏快。他们感觉所教知识与技能是很简单的，教学过程难免着急。会减少学习者的成功体验，这对于初学者来说是很不利的，很容易挫伤他们的学习信心。而那些非专业的教者，更容易理解学习的不易，包容心更强，更会欣赏孩子，孩子也更容易自信，更敢于呈现真实的自己，更愿意表现。久而久之，效果就不一样了。”@@@今天读到佐藤学的《教育方法学》一书中舒曼提出的“基于课堂构想的教材知识”一段的论述。有了新的思考。那位舞蹈很专业的老师，只是教师拥有那些知识技能，他不成功之处在于他无法“根据不同的学生能力及背景将自身所拥有的教育内容的知识转变为强有力的教育学的适当形式的能力”。他只是单纯拥有知识和技能，无法有效地展开教学活动。作为一个专业的教师，要如舒尔曼所说：“必须认识到这个知识的现实意义及其与其他知识间的联系，还需认识到这一知识的生成过程及可达到这一知识的多种方法，更需要认识到学生掌握这个知识的多样方法及可以在课堂中灵活组织对这一知识进行学习的教学方法。”这种复杂的教师的知性能力，舒尔曼将其称为“基于课堂构想的教材知识”。@@@近阶段，网上传播的有关师生冲突的新闻不少，仔细分析，有相当一部分是因为教师不了解儿童心理，不懂教育规律造成的。简单地说，就是教师不够专业引起的。这里的专业包括对儿童心理学、教育学的理解与实践应用。@@@努力学习、努力修炼，继续阅读与思考，争取当一个具有复杂知性能力的教师。用自己的专业性赢得社会的认可，收获教学的幸福感。@@@';


var wittness1 = new Wittness(book1, code_name1, nick_name1, wittness_declaration1, wittness_content1);
wittness1.auto_bulid();


document.getElementById("book").innerHTML = wittness1.wittness_html;
document.getElementById("nuts").innerHTML = '奖励 <strong style="color: red;">' + wittness1.total_nuts(wittness1.simple_wittness_lists_all,wittness1.extract_wittness_lists,wittness1.gnosis_wittness_lists, wittness1.reading_day(wittness1.simple_wittness_lists_all, wittness1.extract_wittness_lists, wittness1.gnosis_wittness_lists) ) + '</strong>' + ' 阅享坚果';

var weixing_name = code_name1 + '坚持读《' +  book1.bookname + '》'+ wittness1.simple_wittness_lists_all.length  + '天阅享见证';

console.log(weixing_name);

console.log();

