/**
 * Created by liuwenju on 2016/6/3.
 */

var book1 = new Book("麦田里的守望者"," 作者： J.D.赛林格，译者：施咸荣 ",300,"凤凰出版传媒集团，译林出版社出版社","《麦田里的守望者》原作名《The Catcher in the Rye》是美国作家杰罗姆·大卫·塞林格唯一的一部长篇小说，塞林格将故事的起止局限于16岁的中学生霍尔顿·考尔菲德从离开学校到纽约游荡的三天时间内，并借鉴了意识流天马行空的写作方法，充分探索了一个十几岁少年的内心世界。愤怒与焦虑是此书的两大主题，主人公的经历和思想在青少年中引起强烈共鸣，受到读者，特别是广大中学生的热烈欢迎。@@@《纽约时报》的书评写道：在美国，阅读《麦田里的守望者》就像毕业要获得导师的首肯一样重要。@@@其后，《麦田里的守望者》直接影响了这一类小说的创作。@@@","2011年2月第1版，2013年12月第7次印刷","",'作者塞林格全名杰罗姆·大卫·塞林格（1919/1/1——2010/1/27）享年91岁，一九一九年生于美国纽约城，父亲是做奶酪和火腿进口生意的犹太商人，家境相当富裕。@@@塞林格十五岁的时候，被父母送到宾夕法尼亚州一个军事学校里住读，据说《麦田里的守望者》中关于寄宿学校的描写，很大部分是以那所学校为背景的。一九三六年，塞林格在军事学校毕业，取得了他毕生唯一的一张文凭。@@@从一九四零年在《小说》杂志上发表他的头一个短篇小说起，到一九五一年出版他的长篇小说《麦田里的守望者》止，在十余年中他共发表了二十多个短篇，有些短篇还在《老爷》、《纽约人》等著名刊物上发表，使他在文学界有了一点点名气。而《麦田里的守望者》则使他一举成名。@@@');
var code_name1 = "0401-小囧熊";
var nick_name1 = "囧熊";
var wittness_declaration1 = '读不懂，也得读下去，总有收获的！';
var forward_content1 ='因为阅享坚果可以兑换现金！@@@详情请联系管理员。QQ：1243646414。@@@';
var donation1 ='坚持读接受个人和社会的捐赠！@@@QQ：1243646414@@@支付宝：jianchidu@qq.com@@@微信号：weiwenshidai@@@';
var evaluate1 ='坚持读的新人，但是阅享见证的水平也很高，阅享见证的格式非常标准，而且阅读真正的进行了思考，受益甚多。阅享见证一次自动生成，为管理员节省了宝贵的时间，是大家学习的榜样，奖励<strong style="color: red;"> 51 </strong>枚阅享坚果。@@@';
var about_us = '坚持读，只为遇见和见证更好的人生。@@@坚持读是一个大家坚持读和阅享见证的开放平台，旨在让大家坚持读的生活更幸福。@@@不喜欢读书但想读书的朋友，想读书但坚持不了的朋友，想让阅读更享受的朋友可以加入公益坚持读群:16805139，坚持读微信订阅号:jianchidu。@@@加入微群,有红包获得，每月的坚持读阅享见证日都会发坚持读祝福红包….如何加入详见QQ群和订阅号。如何开始坚持读，请点击下面的连接。@@@';

var wittness_content1 = '2016年6月26日，开始悦享《麦田里的守望者》，作者： J.D.赛林格，译者：施咸荣，凤凰出版传媒集团，译林出版社出版社，2011年2月第1版，2013年12月第7次印刷，P.1-16特此见证，感谢坚持读！@@@【囧熊摘录】@@@<c>人生</c>的确是场<c>球赛</c>，孩子。人生的确是场大家按照<c>规则</c>进行比赛的球赛。“@@@——P.8@@@“对某些人来说是<c>球赛</c>。你要是参加了<c>实力雄厚</c>的那一边，那倒可以说是场球赛，不错——我愿意承认这一点。可你要是参加了另外一边，一点实力也没有，那么还赛得了什么球？什么也赛不成。根本谈不上什么球赛。”@@@——P.8@@@【囧熊感悟】@@@翻开的 这本书与其他书不一样，没有前序，也没有后序，其他作者的评价也没有，于是对整本书没有一个大概上的把握，只是从头读起，连主人公的名字也是读了一节故事后才知道。@@@书中出现了地名“宾夕法尼亚州”，查了百度，是美国东北部的一个州，最早独立的十三州之一。那么故事就是关于美国的故事了。不知是美国的文化思维与中国有差异，还是坐着本人的写作方式的原因，读者故事，觉得句与句之间，段与段之间，有时候会很跳跃，有点难跟上作者的描述。可能是开放性的缘故，故事里有些字词看起来有些不大文雅。@@@故事的主人公是霍尔顿，他是个不大守规则的孩子，所以不爱学习，四次被学校开除，霍尔顿似乎是由于抽烟而有某些身体的疾病，而来到现在居住的地方检查，这部分读起来不是很懂。@@@“人生是场大家按照规则进行比赛的球赛”，可是人为什么一定要完全照着规则行事呢？有时候有自己的某些不寻常，只要这不寻常不影响整个社会，也不犯法，不也可能让人生这场球赛更精彩吗？霍尔顿应该是个不按规则行事的孩子，故事的题目是《麦田里的守望者》，是不是要讲这个不规则的孩子在麦田里发生的不规则的事呢？@@@老宾斯塞先生与霍尔顿谈了很久，但霍尔顿不喜欢与袒露着胸脯、房间里还有药水味的老人待在一起，撒谎还要去体育馆收拾器材，霍尔顿自己说自己爱说谎，可见真的是个不规则的孩子。@@@故事里对很多人的称呼都加上了“老”字，一开始读来觉得是对年长的人的称呼，毕竟霍尔顿不规则，可能对年长的人怀有某种看不起或是什么，所以加上了“老”字，但读到“老马萨拉”（霍尔顿的同学）时，觉得这可能是美国的文化。@@@霍尔顿多次提到“假模假式”，讲了之前校长的产煤与高地位富有的人，不怎么与地位稍低些的人说话，讲了发横财后回赠母校的奥森贝格也是<c>假模假式</c>的。所以，这个故事是不是要以一个不规则孩子的视觉，来讽刺社会上的一些看似<c>光鲜高尚</c>的事情背后，实际上是<c>虚伪不良</c>的呢？@@@2016年6月27日，悦享《麦田里的守望者》第二天，作者： J.D.赛林格，译者：施咸荣，凤凰出版传媒集团，译林出版社出版社，2011年2月第1版，2013年12月第7次印刷，P.17-36，特此见证，感谢坚持读！@@@【囧熊摘录】@@@他一边说，一边打了个大大的哈欠。就是这类事让我十分恼火。我是说，如果有人一边口口声声要求你帮他什么忙，一边却那么打着呵欠。@@@——P.26@@@这又是另一类让我十分恼火的事。我是说如果你作文做得好，可是有人口口声声谈着标点。斯特拉德莱塔老干这一类事。他要你觉得，他的作文之所以做不好，仅仅是因为他把标点全放错了位置。@@@——P.27@@@【囧熊感悟】@@@百度查了“老”的用法，是用在姓氏前面的一个字。@@@故事有些难读懂，作者描写了霍尔顿的舍友斯特拉德莱塔和隔壁的阿克莱。阿克莱是个邋遢的孩子，不刷牙，又在霍尔顿的房间里不讲卫生的剪指甲，还随意拿起霍尔顿和舍友的私人东西。斯特拉德莱塔外表看起来整洁，但不清理自己的洁具。作者以霍尔顿的视觉来写这两个人物，写的时候写法总有些跳跃，时而说这里，时而说那里，很难读懂作者到底要表达什么，也无法读出两个人物的性格来。霍尔顿对这两个人物，是喜欢，还是讨厌，也理解不了。@@@读到第五章了，与“麦田”还没有什么关系。@@@这个故事有点难读，也读得慢，囧熊想应该坚持下去，读到后面可能就能理解前面了。@@@2016年6月29日，悦享《麦田里的守望者》第三天，作者： J.D.赛林格，译者：施咸荣，凤凰出版传媒集团，译林出版社出版社，2011年2月第1版，2013年12月第7次印刷，P.37-74，特此见证，感谢坚持读！@@@2016年6月30日，悦享《麦田里的守望者》第四天，作者： J.D.赛林格，译者：施咸荣，凤凰出版传媒集团，译林出版社出版社，2011年2月第1版，2013年12月第7次印刷，P.75-165，特此见证，感谢坚持读！@@@2016年7月1日，悦享《麦田里的守望者》第五天，作者： J.D.赛林格，译者：施咸荣，凤凰出版传媒集团，译林出版社出版社，2011年2月第1版，2013年12月第7次印刷，P.166-194，特此见证，感谢坚持读！ @@@';


var wittness1 = new Wittness(book1, code_name1, nick_name1, wittness_declaration1, wittness_content1,about_us,forward_content1,donation1,evaluate1);
wittness1.auto_bulid();


document.getElementById("book").innerHTML = wittness1.wittness_html;
document.getElementById("nuts").innerHTML = '奖励 <strong style="color: red;">' + wittness1.total_nuts(wittness1.simple_wittness_lists_all,wittness1.extract_wittness_lists,wittness1.gnosis_wittness_lists, wittness1.reading_day(wittness1.simple_wittness_lists_all, wittness1.extract_wittness_lists, wittness1.gnosis_wittness_lists) ) + '</strong>' + ' 阅享坚果';

var weixing_name = code_name1 + '坚持读《' +  book1.bookname + '》'+ wittness1.simple_wittness_lists_all.length  + '天阅享见证';

console.log(weixing_name);

console.log();

