/**
 * Created by liuwenju on 2016/6/3.
 */

var book1 = new Book("澳门往事之孤注一掷"," 左四右五 著 ",300,"华龄出版社",'这才是真正的澳门风云！澳门赌场核心人物冒险化名内地出版，著名女作家严歌苓首次作序，<c>激赏</c>推荐！讲述一个叠码仔如何一步步成为贵宾厅厅长，揭露了澳门赌场秘密规则！[1] @@@1999年，澳门回归，内地豪客陆续入境参赌，澳门赌业迎来<c>空前繁荣</c>。借此机遇，内地小镇青年周越彬来到澳门，在十年间，从赌客变成赌场内的叠码仔，逐渐闯出了一番事业，最终成为东哥旗下一等一的贵宾厅厅主。@@@周越彬一方面积极搜寻拉拢来自各方的赌客，他服务于赌客，到一定阶段又成为赌客的对手；另一方面和同行激烈竞争，各凭手段，争夺赌客。他出入赌场第一线，掌握着赌场隐秘的内幕。@@@某一天，澳门赌场来了一个美女老板伊妍，周越彬和她默契合作，逐渐为其所吸引。伊妍一掷千金的背后是寻找失踪的丈夫，周越彬发现她丈夫正是因他而死的徐老板，于是想方设法把她送回了内地。在伊妍第二次来澳门时，周越彬发现自己陷入了人生中最大的一场赌局，<c>波谲云诡</c>中，他该何去何从……[1] @@@迄今为止，最真实、最内幕的澳门赌场小说！和王晶执导的电影《澳门风云》相比，更加<c>详尽</c>也更加<c>露骨</c>的展现了澳门赌场<c>隐秘</c>的江湖暗战。@@@该书同名影视由北京凤凰联动影视文化传播有限公司2016筹备启动中。@@@',"2016年4月第1版，2016年4月第1次印刷","",'<c>左四右五</c>（化名），江苏南京人。早年当过侦察兵，21世纪初定居澳门，涉足博彩业，从叠码仔一步步成为赌场贵宾厅厅主，亲身经历了澳门成为“世界第一赌城”的辉煌十年。@@@2013年，著名作家<c>严歌苓</c>正是以本书作者在澳门的部分经历为材料，写出了长篇小说《妈阁是座城》。@@@');
var code_name1 = "Vip-403-骑士的踪迹";
var nick_name1 = "骑士";
var wittness_declaration1 = '坚持读，读好书，做好事，存好心。';
var forward_content1 ='因为读者可以将<c>阅享坚果兑换成现金</c>！@@@详情请联系管理员。QQ：1243646414。@@@';
var donation1 ='坚持读也有梦想，那就坚持读不断发展，让大家坚持读的更幸福，但坚持读势单力薄，需要更多资金支撑发展，所以坚持读<c>接受个人和社会的捐赠！</c>捐赠者可以第一时间获得坚持读的纪念产品，并作为坚持读的<c>Vip读者</c>，<c>优先享受</c>坚持读的<c>回馈活动</c>。@@@QQ：1243646414@@@支付宝：jianchidu@qq.com@@@微信号：weiwenshidai@@@';
var evaluate1 ='坚持读的老人，阅读量非常大，阅享见证的水平也很高，阅享见证的格式非常标准，而且阅读真正的进行了思考，受益甚多。阅享见证一次自动生成，为管理员节省了宝贵的时间，是大家学习的榜样，奖励<strong style="color: red;"> 16 </strong>枚阅享坚果。@@@';
var about_us = '<c><b>坚持读</b>，只为遇见和见证更好的人生。</c>@@@坚持读是一个大家坚持读和阅享见证的开放平台，旨在让大家坚持读的生活更幸福。@@@不喜欢读书但想读书的朋友，想读书但坚持不了的朋友，想让阅读更享受的朋友可以加入公益<c>坚持读群:16805139</c>，坚持读<c>微信订阅号:jianchidu</c>。@@@加入微群,有红包获得，每月的坚持读阅享见证日都会发<c>坚持读祝福红包</c>….如何加入详见QQ群和订阅号。<c>如何开始坚持读</c>，请点击下面的连接。@@@<p style="white-space: pre-wrap; text-align: center;">    <a href="http://mp.weixin.qq.com/s?__biz=MjM5MzIxNzQyNg==&mid=2650862686&idx=1&sn=466949b3b48c35cd9b60e1d58f456a7f&scene=21#wechat_redirect" target="_blank" data_ue_src="http://mp.weixin.qq.com/s?__biz=MjM5MzIxNzQyNg==&amp;mid=2650862686&amp;idx=1&amp;sn=466949b3b48c35cd9b60e1d58f456a7f&amp;scene=21#wechat_redirect" style="color: rgb(96, 127, 166); text-decoration: none;">如何开始坚持读和阅享见证？</a><br/></p>@@@';

var wittness_content1 = '2016年5月12日，开始悦享《澳门往事之孤注一掷》左四右五 著，华龄出版社2016年4月第1版，2016年4月第1次印刷，特此见证，感谢坚持读。@@@2016年5月12日，悦享《澳门往事之孤注一掷》左四右五 著，华龄出版社2016年4月第1版，2016年4月第1次印刷P.1-42，特此见证，感谢坚持读。@@@【阅享见证-骑士摘录】@@@<c>命运</c>，本就是很奇怪的东西，它调皮，它从不听话，它会在你明明很渴望一件东西时，偏偏不给你，急得你<c>抓耳挠腮</c>、<c>焦头烂额</c>。等到你绝望，要放弃，它又把你所渴望的送到你眼前：“嘿，它早就在这了，你为什么不拿？”@@@命运，有它<c>怪异</c>的存在方式。任何事情，任何东西，强求是求不来的，就算勉强到手，终有一天也会失去。@@@——P.17@@@在澳门，只有真正不赌的人，才会成为最后的<c>赢家</c>。@@@——P.32@@@2016年6月24日，悦享《澳门往事之孤注一掷》左四右五 著，华龄出版社2016年4月第1版，2016年4月第1次印刷P.43-60，特此见证，感谢坚持读。@@@2016年6月25日，悦享《澳门往事之孤注一掷》左四右五 著，华龄出版社2016年4月第1版，2016年4月第1次印刷P.60-75，特此见证，感谢坚持读。@@@2016年6月27日，悦享《澳门往事之孤注一掷》左四右五 著，华龄出版社2016年4月第1版，2016年4月第1次印刷P.76-119，特此见证，感谢坚持读。@@@【阅享见证-骑士摘录】@@@伊妍的想法很简单，也许所有女人都是这样的。她们可以为了自己爱的人吃任何苦，哪怕过的是有了上顿没下顿、<c>食不果腹</c>的日子，她们依然毫无怨言。@@@有句话不是说“有情饮水饱”么。@@@女人都是感情至上的动物，远没有男人在这方面来得理智。@@@可如果有一天，当她们发现，自己心心念念的爱人，已不把自己放在心底，或者说，自己已不是爱人心里那个最重要的了，她们会在一次次的原谅，一次次的失望中，慢慢心寒，最终变得很决绝。这种一去不回头的狠，往往是男人始料不及的。@@@而临到真正的<c>诀别</c>时，女人骨子里因为爱一个人而来的软弱，也是女人所<c>始料不及</c>的。@@@——P.110@@@2016年6月28日，悦享《澳门往事之孤注一掷》左四右五 著，华龄出版社2016年4月第1版，2016年4月第1次印刷P.119-144，特此见证，感谢坚持读。@@@【阅享见证-骑士摘录】@@@毕竟人在冷静的时候才会做出正确的判断，对一个赌钱的人来说，<c>冷静</c>有时候比一百万筹码要值钱多了。@@@——P.123@@@ 老钱接下来说的，仅仅只有一句，却让周越彬忽然动摇了。@@@他说：“你们这种人啊，不自己经历一次，或者不看到自己在乎的人经历一次这样的痛苦，是不会<c>醒悟</c>的！”@@@——P.164@@@越是认为自己理智能够占赌场便宜的人，越是不能接受自己的输。@@@——P.168@@@2016年6月29日，悦享《澳门往事之孤注一掷》左四右五 著，华龄出版社2016年4月第1版，2016年4月第1次印刷P.120-169，特此见证，感谢坚持读。@@@2016年6月30日，悦享《澳门往事之孤注一掷》左四右五 著，华龄出版社2016年4月第1版，2016年4月第1次印刷P.170-214，特此见证，感谢坚持读。@@@【阅享见证-骑士摘录】@@@就像是一堆复燃的死灰，刚刚引火时或许需要一些时间，而一旦点着之后，无论怎么压抑，即便让她变成死灰，内部却依旧在积蓄<c>爆燃</c>的力量，再点着，走向摧毁就是一瞬间的事了。@@@——P.192@@@有时候，在无菌环境中生活的人，一旦进入<c>泥潭</c>中，往往比早先有过免疫力的人垮得更快。@@@——P.193@@@一般来说，赌博的结果有输赢两种，输的时候，你会痛苦，痛苦后，会触发你<c>趋利避害</c>的本能机制——遗忘，而赢得时候，是一种美好，快乐的感觉，多巴胺会强化它，同时也强化了人们对赌博的<c>依赖感</c>。@@@——P.204@@@“我知道，你们叠码仔让客人迷上赌博有个套路是吧？先是<c>欲擒故纵</c>，搞搞神秘，让客人心痒痒，可就是不让他赌，光带他去享受，去消费，这样来吊他口味。然后呢，等他自己提起来，就带他去厅里玩几把，赢点小钱，之后就那什么，‘冷落’是吧？带他去楼下就是赌场的酒店里住着，让他一个人在床上回味，<c>酝酿</c>，以至于心痒难耐，自己跑下来赌。往往就是大输，最后你就可以向他们介绍贵宾厅是什么东西了。”@@@——P.213@@@2016年7月1日，悦享《澳门往事之孤注一掷》左四右五 著，华龄出版社2016年4月第1版，2016年4月第1次印刷P.215-235，特此见证，感谢坚持读。@@@2016年7月2日，悦享《澳门往事之孤注一掷》左四右五 著，华龄出版社2016年4月第1版，2016年4月第1次印刷P.236-272完，特此见证，感谢坚持读。@@@【阅享见证-骑士摘录】@@@其实每个人都有<c>欲望</c>，每个人手里都捏着一个<c>筹码</c>，只是有的人能够<c>保持理智</c>，看清楚眼前的<c>形势</c>，一辈子都没有把这个注下下去。而有的人，随手一丢，就是去了全世界。@@@——P.243@@@【阅享见证-骑士感悟】@@@一切都是自作自受，<c>狼狈为奸</c>就别怪有一天反被狼咬死。@@@——P.249@@@人性的<c>欲望</c>让丑恶来的很迅速，像人生中很多事情都仿佛如这个道理，<c>及时止损</c>再<c>明智</c>不过。保持理智和清醒是面对<c>诱惑</c>和不甘心时最好的<c>药剂</c>。@@@';


var wittness1 = new Wittness(book1, code_name1, nick_name1, wittness_declaration1, wittness_content1,about_us,forward_content1,donation1,evaluate1);
wittness1.auto_bulid();


document.getElementById("book").innerHTML = wittness1.wittness_html;
document.getElementById("nuts").innerHTML = '奖励 <strong style="color: red;">' + wittness1.total_nuts(wittness1.simple_wittness_lists_all,wittness1.extract_wittness_lists,wittness1.gnosis_wittness_lists, wittness1.reading_day(wittness1.simple_wittness_lists_all, wittness1.extract_wittness_lists, wittness1.gnosis_wittness_lists) ) + '</strong>' + ' 阅享坚果';

var weixing_name = code_name1 + '坚持读《' +  book1.bookname + '》'+ wittness1.simple_wittness_lists_all.length  + '天阅享见证';

console.log(weixing_name);

console.log();

