/**
 * Created by liuwenju on 2016/6/3.
 */

var book1 = new Book("教育方法学"," 作者佐藤学，翻译于莉莉 ",300,"教育科学出版社出版","每一秒的爱意都不能被浪费，电影里的意犹未尽全在书里。广受好评的国产爱情片《北京遇上西雅图之不二情书》1012-油翁班主任工作招招鲜原著小说，同步上市！","2016年3月第一版，2016年3月第1次印刷","");
var code_name1 = "2016-福建小尘";
var nick_name1 = "小尘";
var wittness_declaration1 = '坚持读，坚持记，成就更好的自己。';
var wittness_content1 = '本书是国际著名课程专家佐藤学教授的代表作，在日本印刷25次。本书聚焦教学、学习、课堂、课程、教师、教师教育、教育信息化等方面，整理分析了最新的教育学知识与问题，揭示了新的教育实践的方向。本书既是综合概括了近三十年来教育学研究范式转变的航海图，又是提出新的研究方向的罗盘针。本书既是教育学的教科书，也是汇集了作者对书中所网罗知识的独特的个人新见解的心血结晶。书中深入浅出的教学观、课程观、教师观、师生互动观等，带给教师诸多有益启发，读者据此可以建构各自的教育学观、展开独自的教育学设计。本书适合于中小学幼儿教师、校长、教育管理者、教育研究者，以及所有关心中国教育改革的人士阅读。也特别适合中小学幼儿教师和校长培训。@@@不喜欢读书但想读书的朋友，想读书但坚持不了的朋友，想让阅读更享受的朋友可以加入公益坚持读群:16805139，坚持读微信订阅号:jianchidu。加入微群,有红包获得，每月的坚持读阅享见证日都会发坚持读祝福红包….如何加入详见QQ群和订阅号。@@@读者坚持读的老人了，阅享见证非常认真，而且时而会出原创文章，值得大家学习，同时奖励<strong style="color: red;"> 10 </strong>枚阅享坚果，今天正好是父亲节，祝天下的父亲们节日快乐。尘游书海2016164：继续佐藤学@@@2016年6月15日，开始悦享《教育方法学》作者佐藤学，翻译于莉莉,教育科学出版社出版,2016年3月第一版，2016年3月第1次印刷，全书回顾1。特此见证，感谢坚持读。@@@继续佐藤学@@@——读《教育方法学》@@@福建陈秀玉@@@读完《静悄悄的革命》，我真正体会到研究没有国界，我们遇到的问题，日本也曾经遇到，而且他们还深入研究着。作为专家的佐藤学不搞形式主义，而是走访在教学一线，通过大量的实践观察来研究。我很喜欢这种接地气的研究，也就成了佐藤学的粉丝。@@@读完《静悄悄的革命》还余兴未尽，索性翻开他的新书——《教育方法学》。这是一本理论性较强的书籍。我是最害怕理论书籍的，知道自己理论方面的缺失，却常常因为啃不动而放弃。但这是佐藤学的书，佐藤学说：“本书既是综合概括了近三十年来教育学研究范式转变的航海图，又是提出新的研究方向的罗盘针。本书既是教育学的教科书，也是汇集了我对书中所网罗知识的独特的个人新见解的心血结晶。”我想试着啃一啃，看看佐藤学有哪些独特的见解。@@@读了第一章，我知道了“教育方法学是根据在教育过程中产生的实践性问题的对象领域(课堂、学习、课程、教师)所形成的学问体系，不是以特定的学问领域为基础而成立的学问。”还了解到教育方法学的领域“不仅包括教学的技术性原理问题，还包括教室中学生的学习活动问题、课程的构成与评价问题、教室中教师与学生间的会话沟通问题及教师与教师教育等各类相关的问题。”@@@佐藤学说:“教育方法学的研究将这两个不同特征的研究具体化，一个是以特定的学科领域为基础对教育方法学对象(课堂、学习、课程、教师)的相关问题进行探究性研究，另外一个是为解决教室中的具体问题而展开实践性探究。”这两方面相对来说，我更关注后一个。因为每天都会遇到具体的问题，如何把这些烦人的问题变成研究的资源？如何对这些问题进行实践性探究？都是我比较关注的。需要这方面的理论指导。@@@读了教育方法学的历史。了解了:“近代以前的教育方法，教学论的产生——夸美纽斯”，“适应自然教育学——裴斯泰洛齐”，“国民国家教育学——赫尔巴特与赫尔巴特主义”，“儿童中心主义教育与学习的共同体——杜威”，“效率主义教育学——博比特与查特斯”，“单元学习的各种类型”，“行为科学的教育技术学——泰勒与布卢姆”，“从认知教学论到文化教育学——布鲁纳”。对教育方法学的历史有了一个结构化的认识。@@@这些教育界大侠的名字大多听过，特别是夸美纽斯、杜威、布鲁纳。有些词语也熟知，“产婆术”、“最近发展区”、“脚手架”……但对他们思想的了解却不深入，以后一定抽空找出相关书籍详读。@@@读完“日本的教学与授业研究”这一章，我看到了日本教育的改革也是反复的，有时也很迷茫。看来教育问题，是全世界的共同课题。正如书中所说：“今后为解决世界共同的教育改革课题。跨越国界进一步互相交流和学习各自丰富的研究与教学实践经验，将变得更为重要。”@@@看完第四章“教学研究范式的转换”我又了解了把教学过程看作是功能主义式的系统的“过程—产出模型”； 知道了表明认识的相对主义立场的“罗生门方法”；明白了 “探究学习”是通过获得隐含教育内部结构修辞学的过程来实现的；还认识了参与观察法。@@@关于教学的两个概念“模仿模式”与“变化模式”曾主导了亚洲与欧美的教育。佐藤学说：“比较各国教学录像可以发现，与追求同步的、高效的传递大量知识、技能，通过个人间的竞争促进学生熟练掌握知识的中国、韩国、日本的‘模仿模式’相比，欧美的教学中则以每个人都进行多样的、个性化的探究、表现、互相分享，并承认差异的‘变化模式’为主。前者的教学追求‘学会’，后者追求‘理解’。”@@@现在我国也有不少课堂注重“变化模式”的教学。比如我所了解的“大问题教学”和分享式教学，就很注重个性化的探究和互相分享。现在小学的科学课大部分也以探究、分享为主。当然，我们也注意到有些知识学会即可，有些知识不好设计探究活动。而且在大班化教学的课堂，“模仿模式”的教学有时还更高效。面对多种教学概念、教学方式，我们没必要做到非此即彼、非黑即白。就像在今天，在提倡以学生为主体、以活动为导体的课堂教学，我们也不用见到教师讲授就一棍子打死。也就是说“模仿模式”与“变化模式”并没有绝对优劣之分。我的这种想法在书中看到了相同的论述：‘模仿模式’与‘变化模式’这两种教学概念都是教学改革的难题，这两种概念建构了不同的教学意义与形象，但不能说哪一个概念一定正确，哪一个概念一定错误。”@@@在面对名目繁多、不断更新的教育新名词、新做法，我们有时还是要悠着点，不要随意跟风。多从自身出发、多从真实的学生入手，这样的教学改革才更有实效。@@@读了第六章“教室中对话（沟通）的结构”。了解了“课堂教学中的语言行为分析——弗兰德斯的互动分析”，“课堂教学中的沟通——贝拉克的教学分析”“课堂教学的民族学方法论——梅汉的对话分析”，“教室中的对话结构——卡兹顿的社会语言学分析”。@@@关于师生在课堂中的对话，原来还有这么多研究。今后要更用心地观察、记录并适时反思。@@@近年来计算机在教育领域的应用确实比较广泛。现在白板、多媒体在课堂上的运用很多。如何让这些现代化设备服务教学而不是影响教学，是一个值得深思的问题。@@@网络，有人把它当成洪水猛兽般拒绝。也有人把它当成飞翔的双翼。其实网络和其他所有工具一样，本身并无好坏，关键看你怎么用。特别欣赏佐藤学提出的这个观点“我们需要探求的不是会使用计算机的教育，而是不被计算机所‘使用’的教育，不是单纯作为信息和信息的网络中心来建构学校，而应是通过计算机网络编织人与人之间的关系、重新建构学校的公共性与共同性的教育。”@@@计算机互联网充其量就是一个工具，用得好他就是你的助力，用不好说不定你还成了它的“奴隶”。所以“我们需要探求的不是会使用计算机的教育，而是不被计算机所‘使用’的教育”。@@@这本书看完了，但这样的阅读好像也只留下点滴印象，专业阅读是更需要一段持续时间的。这本涵盖了“教学”、“学习”、“课程”、“教师”、“教师教育”、“教育信息化”等主题的书。理论性较强，但不乏现实指导意义。等遇到问题时再重读吧。@@@';


var wittness1 = new Wittness(book1, code_name1, nick_name1, wittness_declaration1, wittness_content1);
wittness1.auto_bulid();


document.getElementById("book").innerHTML = wittness1.wittness_html;
document.getElementById("nuts").innerHTML = '奖励 <strong style="color: red;">' + wittness1.total_nuts(wittness1.simple_wittness_lists_all,wittness1.extract_wittness_lists,wittness1.gnosis_wittness_lists, wittness1.reading_day(wittness1.simple_wittness_lists_all, wittness1.extract_wittness_lists, wittness1.gnosis_wittness_lists) ) + '</strong>' + ' 阅享坚果';

var weixing_name = code_name1 + '坚持读《' +  book1.bookname + '》'+ wittness1.simple_wittness_lists_all.length  + '天阅享见证';

console.log(weixing_name);

console.log();

