/**
 * Created by liuwenju on 2016/6/3.
 */

var book1 = new Book("擦亮爱的那颗星"," 作者：毕淑敏 ",300,"广西师范大学出版社","每一秒的爱意都不能被浪费，电影里的意犹未尽全在书里。广受好评的国产爱情片《北京遇上西雅图之不二情书》1012-油翁班主任工作招招鲜原著小说，同步上市！","2016年6月第1版，2016年6月第1次印刷","");
var code_name1 = "0401—小囧熊";
var nick_name1 = "囧熊";
var wittness_declaration1 = '偶然看到童书，觉得或许有趣，便买了来读！';
var wittness_content1 = '孩子是含苞待放的花朵，是未来的光明与希望。近日，由作家、心理咨询师毕淑敏女士创作编选、广西师范大学出版社青少年文化品牌“神秘岛”推出的“毕淑敏给孩子的心灵成长书”于6月温情上市。每个孩子在成长过程中，都会遇到不同的烦恼。学习上的困难，人际交往中的困惑，努力后却没有回报……这些成年人看来再平常不过的小事，在不谙世事的孩子们眼中却如此重要。很多孩子因为没有以积极的心态去面对这些挫折，父母也没有及时发现与指导，而导致孩子产生了各种心理问题。“毕淑敏给孩子的心灵成长书”系列共6册，包含了爱、成功、人生、自信、成长和亲情六大主题，从心灵成长的不同方面引导孩子遇到问题勇敢面对，妥善解决成长过程中的心灵谜题。书中的成长故事均来源于真实生活，涵盖了孩子在成长过程中可能遇到的很多关键问题。在与孩子展开内心对话的同时，帮助父母进入孩子的世界，在理解与沟通的基础上使孩子学会爱与被爱，拥有健全人格，快乐成长。在正视失败的同时，更要学会面对成功处在成长过程中的孩子们，遭遇挫折在所难免。很多孩子在正确的引导下逐渐意识到挫折并不可怕，并且能够以积极的心态去面对。毕淑敏却发现，在挫折与成功的关系上，有些孩子似乎走入了另外一个极端——遭遇挫折时不躲避不气馁，获得成功和掌声时却缺少了那份应有的自豪与自信，很多时候被父母教导“别骄傲”“要荣辱不惊”…… 从心理学角度来看，面对成功，孩子也需要正视与鼓励。正如在“毕淑敏给孩子的心灵成长书”中所提到的：“丰收的季节，先不要去想可能的灾年。我们要和朋友们跳舞唱歌，渲染喜悦。既然种子已经回报了汗水，我们就有权沉浸幸福。不要管以后的风霜雨雪，让我们先把麦子磨成面粉，烘一个香喷喷的面包。”能直面挫折带来的痛苦，也能享受成功带来的喜悦，是成长的必修课程之一。不仅要做孩子成长路上的指明灯，更要当好领路人。同时兼具作家与心理咨询师身份的毕淑敏，善于捕捉并感知内心世界的呼声。毕淑敏在担任心理咨询师时发现，很多家长不知道该怎样向孩子表达爱，孩子也不知道该怎样去理解父母的爱。父母与子女之间，沟通是最简单的途径，却也成为了最难跨越的障碍。在“毕淑敏给孩子的心灵成长书”中，作者将自己遇到的真实事例娓娓道来，并利用心理学知识和累积的工作经验提出了自己对父母在子女成长过程中角色定位的一些看法。家庭中的每个人都是独立的个体，但孩子的成长需要在父母的陪伴下进行。陪伴不等于专权，父母与孩子保持积极、良性、平等的沟通，和谐有爱的家庭氛围，才是孩子成长之路的基石。理性看待孩子青春期的心理变化青春期是孩子身心变化最为迅速、明显的时期，这个时期的孩子既希望自己能快快成为大人，又留恋童年时光；既拒绝大人向自己灌输“陈腐”的理念，又渴望着能得到大人的理解和帮助。在人际交往中，更加倾向与同伴一起交流，在小伙伴中彼此分享，寻求共鸣。面对这种情况，父母往往很难理解，然而这些变化正是青春期孩子的重要特点。青春期的成长，意味着更多的变化与挑战，也伴随着更多的焦灼和忧虑。此时父母关注的目光，大多投向了孩子的学习成绩，却忽视了孩子的心理成长。在“毕淑敏写给孩子的心灵成长书”中，作者通过很多青春期的成长小故事，阐述了她作为心理咨询师，同时也作为母亲，对青春期孩子心理变化的看法。青春期的孩子在遇到心理问题时，更需要父母理性、平等的看待，才能帮孩子平稳、顺利地度过青春期。@@@不喜欢读书但想读书的朋友，想读书但坚持不了的朋友，想让阅读更享受的朋友可以加入公益坚持读群:16805139，坚持读微信订阅号:jianchidu。加入微群,有红包获得，每月的坚持读阅享见证日都会发坚持读祝福红包….如何加入详见QQ群和订阅号。@@@读者坚持读的新人，但是阅享见证的很认真，阅享见证的水平也很高，奖励<strong style="color: red;"> 4 </strong>枚阅享坚果。@@@2016年6月21日，开始悦享《擦亮爱的那颗星》，作者：毕淑敏，广西师范大学出版社，2016年6月第1版，2016年6月第1次印刷，序言P.001-003，正文P.001-084，特此见证，感谢坚持读 ！@@@【悦享见证-囧熊摘录】@@@书，就是我们精神的小外套。你不必时时带在身上，但你的衣橱里要有它们，你穿过，知道它合体。你会在某个时刻用上它，塔带给你温暖，让你不得病，平安度过冷暖未知的人生。@@@序言——P.003@@@主管记住什么、忘记什么的中枢，听从的是情感的指令。我们天生愿意保存那些美好、善良、友谊、勇敢的事件，不爱记着那些丑恶、虚伪、背叛、怯懦的片段。@@@——P.011@@@只有自己的心成长了，才会在不经意间收获柔和。@@@——P.015@@@真诚可以分解为真实和坦诚。@@@——P.033@@@加上了“善”这个疆绳，真就升华了，不再是本真，而有了一种更全面更伟大的品格。@@@——P.034@@@孩子大睁着好奇的双眼，面对着为知的世界，不断地惊奇着、探索着，在惊奇中渐渐长大。@@@——P.049@@@惊奇是由两部分组成的，先有了惊，然后才是奇。如果“惊”属于一种对陌生事物认识局限的愕然，“奇”则是对未知事物积极探讨的萌芽了。否认了“惊”，就扼杀了它的同胞兄弟。我们将在无意之中，失去众多丰富自己的机会。@@@——P.051@@@就像空气、水和盐一样，精神的必需品——爱、欢乐和团圆，是非常朴素却须臾不可离开的。@@@——P.070@@@2016年6月22日，悦享《擦亮爱的那颗星》第二天，作者：毕淑敏，广西师范大学出版社，2016年6月第1版，2016年6月第1次印刷， P.085-158，特此见证，感谢坚持读 ！@@@【悦享见证-囧熊摘录】@@@在水中自由地遨游，闲暇的时候挣脱一切羁绊，到岸上享受晨风拂面，然后，一个华丽的俯冲，重新潜入关系之水，做一条鱼在波涛下微笑。@@@——P.086@@@看来十万根钢丝也无法保证我们的心境不受损毁。更不消说，人是不能每时每刻都裹在钢丝里面的，那样我们将丧失对人间百态的灵敏触碰和对风花雪月赏心悦目的叹息。@@@——P.090@@@眼睛还有小小的癖好，爱看草木的绿色和天空的湛蓝，爱看书本和笑靥。满足它的愿望，非礼勿视，这就是对眼睛好。@@@——P.099@@@';


var wittness1 = new Wittness(book1, code_name1, nick_name1, wittness_declaration1, wittness_content1);
wittness1.auto_bulid();


document.getElementById("book").innerHTML = wittness1.wittness_html;
document.getElementById("nuts").innerHTML = '奖励 <strong style="color: red;">' + wittness1.total_nuts(wittness1.simple_wittness_lists_all,wittness1.extract_wittness_lists,wittness1.gnosis_wittness_lists, wittness1.reading_day(wittness1.simple_wittness_lists_all, wittness1.extract_wittness_lists, wittness1.gnosis_wittness_lists) ) + '</strong>' + ' 阅享坚果';

var weixing_name = code_name1 + '坚持读《' +  book1.bookname + '》'+ wittness1.simple_wittness_lists_all.length  + '天阅享见证';

console.log(weixing_name);

console.log();

